{
  "activation": "gelu",
  "architectures": [
    "DistilBertForMaskedLM"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "anger",
    "1": "fear",
    "2": "disgust",
    "3": "sadness",
    "4": "joy",
    "5": "none of them"
  },
  "initializer_range": 0.02,
  "label2id": {
    "anger": 0,
    "disgust": 2,
    "fear": 1,
    "joy": 4,
    "none of them": 5,
    "sadness": 3
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "output_past": true,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": true,
  "tie_weights_": true,
  "transformers_version": "4.57.6",
  "vocab_size": 31102
}
